perf-testing/theoretical-upper-bound/bound_with_immediate_flush.txt
Running 30s test @ http://localhost:8000/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.34us  177.86us   5.68ms   99.27%
    Req/Sec    15.65k   459.30    16.36k    79.33%
  Latency Distribution
     50%   57.00us
     75%   58.00us
     90%   60.00us
     99%  126.00us
  467333 requests in 30.00s, 39.67MB read
Requests/sec:  15577.84
Transfer/sec:      1.32MB
total requests: 467333