perf-testing/theoretical-upper-bound/dummy_endpoint_with_map.txt
Running 30s test @ http://localhost:8000/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.32us  223.93us   6.41ms   99.18%
    Req/Sec    18.05k   644.24    18.77k    87.33%
  Latency Distribution
     50%   49.00us
     75%   50.00us
     90%   51.00us
     99%  120.00us
  538687 requests in 30.00s, 45.72MB read
Requests/sec:  17955.81
Transfer/sec:      1.52MB
total requests: 538687